# SQL

Accessing data stored in databases is a routine exercise. I demonstrate a few helpful methods in the Jupyter Notebook.

In [2]:
%load_ext sql_magic

The sql_magic extension is already loaded. To reload it, use:
  %reload_ext sql_magic

In [3]:
import sqlalchemy
import pandas as pd
import sqlite3
from sqlalchemy import create_engine
sqlite_engine = create_engine('sqlite://')

In [4]:
%config SQL.conn_name = "sqlite_engine"

In [5]:
%config SQL

SQL options
---------
SQL.conn_name=<Unicode>
    Current: 'sqlite_engine'
    Object name for accessing computing resource environment
SQL.notify_result=<Bool>
    Current: True
    Notify query result to stdout
SQL.output_result=<Bool>
    Current: True
    Output query result to stdout

In [6]:
%config SQL.output_result = False

```SQL
CREATE TABLE presidents (first_name, last_name, year_of_birth);
INSERT INTO presidents VALUES ('George', 'Washington', 1732);
INSERT INTO presidents VALUES ('John', 'Adams', 1735);
INSERT INTO presidents VALUES ('Thomas', 'Jefferson', 1743);
INSERT INTO presidents VALUES ('James', 'Madison', 1751);
INSERT INTO presidents VALUES ('James', 'Monroe', 1758);
INSERT INTO presidents VALUES ('Zachary', 'Taylor', 1784);
INSERT INTO presidents VALUES ('Abraham', 'Lincoln', 1809);
INSERT INTO presidents VALUES ('Theodore', 'Roosevelt', 1858);
INSERT INTO presidents VALUES ('Richard', 'Nixon', 1913);
INSERT INTO presidents VALUES ('Barack', 'Obama', 1961);
```

In [7]:
%%read_sql temp
CREATE TABLE presidents (first_name, last_name, year_of_birth);
INSERT INTO presidents VALUES ('George', 'Washington', 1732);
INSERT INTO presidents VALUES ('John', 'Adams', 1735);
INSERT INTO presidents VALUES ('Thomas', 'Jefferson', 1743);
INSERT INTO presidents VALUES ('James', 'Madison', 1751);
INSERT INTO presidents VALUES ('James', 'Monroe', 1758);
INSERT INTO presidents VALUES ('Zachary', 'Taylor', 1784);
INSERT INTO presidents VALUES ('Abraham', 'Lincoln', 1809);
INSERT INTO presidents VALUES ('Theodore', 'Roosevelt', 1858);
INSERT INTO presidents VALUES ('Richard', 'Nixon', 1913);
INSERT INTO presidents VALUES ('Barack', 'Obama', 1961);

Query started at 07:23:20 PM PDT; Query executed in 0.00 m

In [8]:
%%read_sql df
SELECT * FROM presidents

Query started at 07:23:41 PM PDT; Query executed in 0.00 m

In [9]:
df

  first_name   last_name  year_of_birth
0     George  Washington           1732
1       John       Adams           1735
2     Thomas   Jefferson           1743
3      James     Madison           1751
4      James      Monroe           1758
5    Zachary      Taylor           1784
6    Abraham     Lincoln           1809
7   Theodore   Roosevelt           1858
8    Richard       Nixon           1913
9     Barack       Obama           1961

## Inline magic

In [ ]:
later_presidents = %read_sql SELECT * FROM presidents WHERE year_of_birth > 1825
later_presidents

## Through pandas directly

In [10]:
birthyear = 1800

In [ ]:
%%read_sql df1
SELECT first_name,
       last_name,
       year_of_birth
FROM presidents
WHERE year_of_birth > {birthyear}

In [ ]:
df1

In [11]:
con = sqlite3.connect("presidents.sqlite")
cur = con.cursor()

new_dataframe = pd.read_sql(f"""SELECT first_name, last_name, year_of_birth
                               FROM presidents
                               WHERE year_of_birth > {birthyear}
                               """, 
                            con=con)

con.close()

In [12]:
new_dataframe

  first_name  last_name  year_of_birth
0   Theodore  Roosevelt           1858
1    Richard      Nixon           1913
2     Barack      Obama           1961